
public class BitOperator {
	public static void main(String[] args) {
		
		//1.先得到2的补码 = 原码 = 00000000 00000000 00000000 00000010
		//2.其次3的补码 = 原码 = 00000000 00000000 00000000 00000011
		//3.按位& 00000000 00000000 00000000 00000010
		System.out.println(2 & 3);
		
		// -2 原码 10000000 00000000 00000000 00000010
		// -2 补码 11111111 11111111 11111111 11111110
		// ~-2    10000000 00000000 00000000 00000001
		// 结果 1
		System.out.println(~ -2);

		// 2 原码 00000000 00000000 00000000 00000010
		// 2 补码 00000000 00000000 00000000 00000010
		//~2 结果 11111111 11111111 11111111 11111101
		// 复原   10000000 00000000 00000000 00000011
		// -3
		System.out.println(~ 2);

		System.out.println(2 | 3);

		System.out.println(2 ^ 3);
		// 本质/2 非数学算数
		System.out.println(1 >> 2);
		// 本质*2 
		System.out.println(1 << 2);

	}
}